In [2]:
import pandas as pd

In [3]:
tables = pd.read_html("https://www.w3schools.com/html/html_tables.asp", header=0)

In [4]:
table = tables[0]

In [5]:
table

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [6]:
table.to_excel("info.xlsx")

In [8]:
type(table["Company"])

pandas.core.series.Series

In [9]:
type(table)

pandas.core.frame.DataFrame

In [10]:
names = ["Anuj", "Ravi", "Gagan", "Tapan", "Rohan"]

In [23]:
ages = [28, 21, 15, 21, 23]

vals = [21, 15, 21, 23, 28]

In [13]:
s_names = pd.Series(names)

In [14]:
s_ages = pd.Series(ages)

In [17]:
pd.DataFrame([s_names, s_ages]).T

       0   1
0   Anuj  28
1   Ravi  21
2  Gagan  15
3  Tapan  21
4  Rohan  23

In [58]:
data = {}
data["name"] = names
data["age"] = ages
data["values"] = vals

df = pd.DataFrame(data)

In [59]:
df.dtypes

name      object
age        int64
values     int64
dtype: object

In [33]:
data = list(zip(names, ages, vals))

In [34]:
pd.DataFrame(data, columns=["name", "age", "value"])

    name  age  value
0   Anuj   28     21
1   Ravi   21     15
2  Gagan   15     21
3  Tapan   21     23
4  Rohan   23     28

In [60]:
import numpy as np

In [61]:
data = np.random.randint(10, 20, (10, 5))

In [62]:
data

array([[11, 11, 17, 15, 15],
       [14, 11, 14, 11, 19],
       [11, 19, 17, 14, 10],
       [18, 15, 14, 11, 19],
       [12, 18, 18, 15, 17],
       [12, 10, 14, 11, 15],
       [19, 19, 15, 12, 15],
       [11, 11, 17, 11, 14],
       [10, 17, 11, 17, 17],
       [17, 15, 15, 13, 10]])

In [63]:
df = pd.DataFrame(data, columns=list("ABCDE"))

In [64]:
df["B"]

0    11
1    11
2    19
3    15
4    18
5    10
6    19
7    11
8    17
9    15
Name: B, dtype: int64

In [65]:
df.A

0    11
1    14
2    11
3    18
4    12
5    12
6    19
7    11
8    10
9    17
Name: A, dtype: int64

In [66]:
df["F"] = 0

In [67]:
df

    A   B   C   D   E  F
0  11  11  17  15  15  0
1  14  11  14  11  19  0
2  11  19  17  14  10  0
3  18  15  14  11  19  0
4  12  18  18  15  17  0
5  12  10  14  11  15  0
6  19  19  15  12  15  0
7  11  11  17  11  14  0
8  10  17  11  17  17  0
9  17  15  15  13  10  0

In [68]:
df["G"] = range(50, 70, 2)

In [69]:
df

    A   B   C   D   E  F   G
0  11  11  17  15  15  0  50
1  14  11  14  11  19  0  52
2  11  19  17  14  10  0  54
3  18  15  14  11  19  0  56
4  12  18  18  15  17  0  58
5  12  10  14  11  15  0  60
6  19  19  15  12  15  0  62
7  11  11  17  11  14  0  64
8  10  17  11  17  17  0  66
9  17  15  15  13  10  0  68

In [74]:
df.sort_values(["A", "B"])

    A   B   C   D   E  F   G
8  10  17  11  17  17  0  66
0  11  11  17  15  15  0  50
7  11  11  17  11  14  0  64
2  11  19  17  14  10  0  54
5  12  10  14  11  15  0  60
4  12  18  18  15  17  0  58
1  14  11  14  11  19  0  52
9  17  15  15  13  10  0  68
3  18  15  14  11  19  0  56
6  19  19  15  12  15  0  62

In [75]:
df.sort_values(["A"])

    A   B   C   D   E  F   G
8  10  17  11  17  17  0  66
0  11  11  17  15  15  0  50
2  11  19  17  14  10  0  54
7  11  11  17  11  14  0  64
4  12  18  18  15  17  0  58
5  12  10  14  11  15  0  60
1  14  11  14  11  19  0  52
9  17  15  15  13  10  0  68
3  18  15  14  11  19  0  56
6  19  19  15  12  15  0  62